N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWRLib.c
/*! *********************************************************************************
* Copyright (c) 2015, Freescale Semiconductor, Inc.
* Copyright 2016-2020 NXP
* All rights reserved.
*
* \file
*
* SPDX-License-Identifier: BSD-3-Clause
********************************************************************************** */

/*****************************************************************************
 *                               INCLUDED HEADERS                            *
 *---------------------------------------------------------------------------*
 * Add to this section all the headers that this module needs to include.    *
 *---------------------------------------------------------------------------*
 *****************************************************************************/
#include "EmbeddedTypes.h"
#include "fsl_device_registers.h"
#include "board.h"
#include "PWR_Configuration.h"
#include "PWRLib.h"
#include "TimersManager.h"
#include "fsl_os_abstraction.h"
#include "Keyboard.h"
#include "GPIO_Adapter.h"
#include "gpio_pins.h"
#include "MemManager.h"
#include "DCDC.h"
#include "fsl_lptmr.h"
#include "NVM_Interface.h"

#if (cPWR_UsePowerDownMode)
#if defined(cPWR_BLE_LL_Enable) && (cPWR_BLE_LL_Enable == 1)
#include "controller_interface.h"
#endif
#if (cPWR_EnableDeepSleepMode_8 || cPWR_EnableDeepSleepMode_5 || cPWR_EnableDeepSleepMode_9)
#include "setjmp.h"
#endif
#endif

#if defined(gPWR_RamOffDuringAdv_d) && (gPWR_RamOffDuringAdv_d == 1)
#include "Flash_adapter.h"
#include "fsl_edma.h"
#include "fsl_dmamux.h"
#endif

/*****************************************************************************
 *                             PRIVATE MACROS                                *
 *---------------------------------------------------------------------------*
 * Add to this section all the access macros, registers mappings, bit access *
 * macros, masks, flags etc ...                                              *
 *---------------------------------------------------------------------------*
 *****************************************************************************/
#define mLptmrTimoutMaxMs_c             (65535000)

/* Define KW35/KW36 LPUART IRQ number */
#if FSL_FEATURE_LPUART_HAS_SHARED_IRQ0_IRQ1
#define mUartIrq_d (LPUART0_LPUART1_IRQn)
#else
#define mUartIrq_d (LPUART0_IRQn)
#endif

#define LPTMR_MAX_CNT_VALUE (( (uint32_t)1U << 16U)- (uint32_t)1U)
#define LPTMR_CLK_FREQ                  32768U

#define PRWLIB_RAM_BANK_16K             0U
#define PRWLIB_RAM_BANK_32K             1U
#define PRWLIB_RAM_BANK_ALL             2U

#ifndef cPWR_UsePartialStopMode
/* If DCDC is configured in bypass mode, use a partial stop mode by keeping the bus clock enabled
    This is a workaround for a modified board for DCDC Bypass which faces issues caused
    by normal stop mode */
#if (APP_DCDC_MODE == gDCDC_Bypass_c)
#define cPWR_UsePartialStopMode         1
#else
#define cPWR_UsePartialStopMode         0
#endif
#endif

typedef void (*ram_func_t)(void);
typedef union ram_func_ptr_tag
{
    uint32_t    instructionArrayAddress;
    ram_func_t  ram_func_ptr;
} ram_func_ptr_t;

#if defined(gPWR_RamOffDuringAdv_d) && (gPWR_RamOffDuringAdv_d == 1)
extern uint32_t m_ram_img_start;
extern uint32_t m_ram_img_end;
extern uint32_t m_max_ram_img_size;

#define gPWR_RamContextFlashBaseAddr   (uint32_t)(&m_ram_img_start)

#define PWRLIB_IMG_MAGIC               0x12345678u
#define PWRLIB_IMG_END_MAGIC           0x87654321u
#define PWRLIB_STACK_ADDR_MARGIN       0xC0u
#define PWRLIb_MAX_RAM_SIZE            (uint32_t)(&m_max_ram_img_size)

/* set 1Khz frequency clock (/32) */
#ifndef PWRLib_LPTMR_FREQ_DIV
#define PWRLib_LPTMR_FREQ_DIV           4u
#endif

uint8_t gPWRLib_RamSavedStatus = PWRLIB_RAM_SAVE_COUNT_DOWN;

typedef struct
{
    uint32_t img_valid_magic;
    uint32_t img_size;
    uint32_t img_location_addr;
}  pwrlib_img_header_t;

typedef struct
{
    volatile uint32_t img_end_magic;
}  pwrlib_img_footer_t;
#endif


#if (!defined(GCOV_DO_COVERAGE) || (GCOV_DO_COVERAGE == 0))
#define PWRLIB_NOP    PWRLib_ExecuteNop()
#define PWRLIB_STATIC static
#define PWRLIB_PUBLIC
#else
#define PWRLIB_NOP    break
#define PWRLIB_STATIC __WEAK
#define PWRLIB_PUBLIC __WEAK
#endif


/*****************************************************************************
 *                               PRIVATE VARIABLES                           *
 *---------------------------------------------------------------------------*
 * Add to this section all the variables and constants that have local       *
 * (file) scope.                                                             *
 * Each of this declarations shall be preceded by the 'static' keyword.      *
 * These variables / constants cannot be accessed outside this module.       *
 *---------------------------------------------------------------------------*
 *****************************************************************************/

#if defined(cPWR_UsePowerDownMode) && (cPWR_UsePowerDownMode == 1)
#if (cPWR_EnableDeepSleepMode_8 || cPWR_EnableDeepSleepMode_5 || cPWR_EnableDeepSleepMode_9)
static jmp_buf                 pwr_CPUContext;
#endif

/*
 * When entring the stop modes, the flash prefetch might be interrupted, thus
 * the prefetched code or data might be broken. To make sure the flash is idle
 * when entring the stop modes, the code is moved to ram. And delay for a while
 * before WFI to make sure previous flash prefetch is finished.
 *
 * Only need to do like this when code is in flash, if code is in rom or ram,
 * this is not necessary.
 * The ram function code is:
 *
 *  uint32_t i;
 *  for (i=0; i<0x8; i++)
 *  {
 *      __NOP();
 *  }
 *  __DSB();
 *  __WFI();
 *  __ISB();
 */
static uint16_t s_stopRamFuncArray[] = {
    0x2000,         /* MOVS R0, #0 */
    0x2808,         /* CMP R0, #8 */
    0xD202,         /* BCS.N */
    0xBF00,         /* NOP */
    0x1C40,         /* ADDS R0, R0, #1 */
    0xE7FA,         /* B.N */
    0xF3BF, 0x8F4F, /* DSB */
    0xBF30,         /* WFI */
    0xF3BF, 0x8F6F, /* ISB */
    0x4770,         /* BX LR */
};

