N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWRLib.c
/* LPTMR variables */
static uint32_t mPWRLib_RTIElapsedTicks = 0U;

extern uint32_t __FIRMWARE_END_ADDRESS[];
extern uint32_t __CSTACK_end__[];
#if defined(gPWR_RamOffDuringAdv_d) && (gPWR_RamOffDuringAdv_d == 1)
extern uint32_t m_warmboot_stack_end;
#endif
#endif /* (cPWR_UsePowerDownMode == 1) */

/* For LVD function */
#if (cPWR_LVD_Enable == 2)
tmrTimerID_t PWRLib_LVD_PollIntervalTmrID;
PWRLib_LVD_VoltageLevel_t PWRLib_LVD_SavedLevel;
#endif /* (cPWR_LVD_Enable == 2) */

/*****************************************************************************
 *                               PUBLIC VARIABLES                            *
 *---------------------------------------------------------------------------*
 * Add to this section all the variables and constants that have global      *
 * (project) scope.                                                          *
 * These variables / constants can be accessed outside this module.          *
 * These variables / constants shall be preceded by the 'extern' keyword in  *
 * the interface header.                                                     *
 *---------------------------------------------------------------------------*
 *****************************************************************************/

volatile PWRLib_WakeupReason_t PWRLib_MCU_WakeupReason;
uint32_t mPWR_DeepSleepTimeMs     = cPWR_DeepSleepDurationMs;

/* Application state stored */
PWR_AppState PWRLib_AppState            = PWR_APP_STATE_INVALID;
uint8_t      mPWRLib_DeepSleepMode      = cPWR_DeepSleepMode;
uint32_t     PWRLib_wkup_pin_setup      = 0u;

#if defined(gPWR_RamOffDuringAdv_d) && (gPWR_RamOffDuringAdv_d == 1)
static volatile uint32_t             s_pu8Stack;
static pwrlib_img_header_t* const pwrlib_img_flash_header_p = (pwrlib_img_header_t*)(gPWR_RamContextFlashBaseAddr);
#endif

#if defined(cPWR_UsePowerDownMode) && (cPWR_UsePowerDownMode == 1)
/*****************************************************************************
 *                           PRIVATE FUNCTIONS PROTOTYPES                    *
 *---------------------------------------------------------------------------*
 * Add to this section all the functions prototypes that have local (file)   *
 * scope.                                                                    *
 * These functions cannot be accessed outside this module.                   *
 * These declarations shall be preceded by the 'static' keyword.             *
 *---------------------------------------------------------------------------*
 *****************************************************************************/

/*---------------------------------------------------------------------------
* Name: PWRLib_GetCstaskAddr
* Description: returns C-stack end address
*---------------------------------------------------------------------------*/
PWRLIB_STATIC uint32_t PWRLib_GetCstaskAddr(void)
{
	/* returns C-stack end address */
	return (uint32_t)&__CSTACK_end__;
}

/*---------------------------------------------------------------------------
* Name: PWRLib_GetFwEndAddr
* Description: returns Firmware end address
*---------------------------------------------------------------------------*/
PWRLIB_STATIC uint32_t PWRLib_GetFwEndAddr(void)
{
	/* returns Firmware end address */
	return (uint32_t)&__FIRMWARE_END_ADDRESS;
}

/*****************************************************************************
 *                                PRIVATE FUNCTIONS                          *
 *---------------------------------------------------------------------------*
 * Add to this section all the functions that have local (file) scope.       *
 * These functions cannot be accessed outside this module.                   *
 * These definitions shall be preceded by the 'static' keyword.              *
 *---------------------------------------------------------------------------*
*****************************************************************************/

/*---------------------------------------------------------------------------
* Name: PWRLib_ExecuteNop
* Description: Executes NOP instruction, used mainly for Misra
*---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode) && (cPWR_BLE_LL_Enable)
PWRLIB_STATIC void PWRLib_ExecuteNop(void)
{
    /* Putting ASM instruction in a static function to isolate the code
       and fix related MISRA issue */
    asm volatile("NOP");
}
#endif

static void PWRLib_LLWU_UpdateWakeupReasonExt(uint32_t llwuFlags)
{
    uint32_t llwuFlags_wkup_pins;

    /* Filter on wakeup pins */
    llwuFlags_wkup_pins = (llwuFlags & 0xFFFFU);

#if (defined(gSerialManagerMaxInterfaces_c)&&(gSerialManagerMaxInterfaces_c > 0))
    if((llwuFlags_wkup_pins & pwr_llwu_serial_bitmap) != 0U)
    {
        //PWR_DBG_LOG("%x", llwuFlags_wkup_pins);

        PWRLib_MCU_WakeupReason.Bits.FromSerial = 1;

        /* remove these pins from the llwuFlags so we can then detect the keyboard pins */
        llwuFlags_wkup_pins &= ~pwr_llwu_serial_bitmap;
    }
#endif

    if ( llwuFlags_wkup_pins != 0U )
    {
        /* if wakeup pin is not from serial, assume this is from Keyboard */
        PWRLib_MCU_WakeupReason.Bits.FromKeyBoard = 1;
    }

    if((llwuFlags & gPWRLib_LLWU_WakeupModuleFlag_LPTMR_c) != 0U)
    {
        PWRLib_MCU_WakeupReason.Bits.FromLPTMR = 1U;
        PWRLib_MCU_WakeupReason.Bits.DeepSleepTimeout = 1U;
    }

    if((llwuFlags & gPWRLib_LLWU_WakeupModuleFlag_Radio_c) != 0U)
    {
        PWRLib_MCU_WakeupReason.Bits.FromBLE_LLTimer = 1U;

        if( RSIM_CONTROL_READ_FIELD(RSIM_DSM_CONTROL_GEN_SYSCLK_REQ_INT) != 0U)
        {
            PWRLib_MCU_WakeupReason.Bits.FromRadio = 1U;
        }

        PWRLib_MCU_WakeupReason.Bits.DeepSleepTimeout = 1U;
    }

    if((llwuFlags & gPWRLib_LLWU_WakeupModuleFlag_DCDC_c) != 0U)
    {
        PWRLib_MCU_WakeupReason.Bits.FromPSwitch = 1;

        /* Clear pSwitch interrupt */
        DCDC->REG6 |= DCDC_REG6_PSWITCH_INT_CLEAR_MASK;
        DCDC->REG6 &= ~DCDC_REG6_PSWITCH_INT_CLEAR_MASK;
    }

    if((llwuFlags & gPWRLib_LLWU_WakeupModuleFlag_RTC_Alarm_c) != 0U)
    {
        PWRLib_MCU_WakeupReason.Bits.FromRtcAlarm = 1;
    }

