N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWRLib.c
    if((llwuFlags & gPWRLib_LLWU_WakeupModuleFlag_RTC_Seconds_c) != 0U)
    {
        PWRLib_MCU_WakeupReason.Bits.FromRtcSeconds = 1;
    }
}

#if 0
static void PWRLib_DisableIRQs(void)
{
    int irq = (int)0;
    while(irq <= (int)PORTB_PORTC_IRQn)
    {
        NVIC_DisableIRQ( (IRQn_Type)irq );
        irq++;
    }
}
#endif

PWRLIB_STATIC void PWRLib_ExecuteWfiFromRam(void)
{
    ram_func_ptr_t ram_func_ptr;

    /* The function is represented by an array of thumb instructions (16 bits)
       To indicate it's a thumb code, the less significant bit must be set to 1 */
    ram_func_ptr.instructionArrayAddress = ((uint32_t)(s_stopRamFuncArray)) + 1U;
    ram_func_ptr.ram_func_ptr();
}

static uint32_t PWRLib_GetFwUpperLimit(void)
{
    uint32_t heap_upper_limit;
    uint32_t firmware_upper_limit;

    heap_upper_limit = MEM_GetHeapUpperLimit();

    if( heap_upper_limit > (PWRLib_GetCstaskAddr() )) /* Optimized linker script and memory manager, stack is placed below the heap */

    {
        /* Light MemManager and _lp linker script used         */
        firmware_upper_limit = heap_upper_limit;
    }
    else
    {
        /* legacy MemManager used or linker script not optimized for lowpower
            => Use the __FIRMWARE_END_ADDRESS symbol from the linker to assess the RAM end of the firmware */
        firmware_upper_limit = PWRLib_GetFwEndAddr();
    }
    return firmware_upper_limit;
}

static void PWRLib_LLWU_Init(void)
{
#if defined(BOARD_LLWU_PIN_ENABLE_BITMAP) && (BOARD_LLWU_PIN_ENABLE_BITMAP)
    uint16_t pinEn16 = BOARD_LLWU_PIN_ENABLE_BITMAP;
    uint32_t PinEn32 = 0UL;
    uint32_t i;

    /* Can not use dynamic and static wakeup pin configurations, please choose */
    assert( PWRLib_wkup_pin_setup == 0u );

    for(i=0U; pinEn16 != 0U ; i++)
    {
        if((pinEn16 & 0x1) != 0U)
        {
            PinEn32 |= 0x3UL<<(i<<1);
        }
        pinEn16 >>= 1;
    }
    LLWU->PE1 = PinEn32&0xffUL;
    LLWU->PE2 = (PinEn32>>8)&0xffUL;
    LLWU->PE3 = (PinEn32>>16)&0xffUL;
    LLWU->PE4 = (PinEn32>>24)&0xffUL;
#else

    PWRLib_SetWakeupPins(PWRLib_wkup_pin_setup);

#endif /* BOARD_LLWU_PIN_ENABLE_BITMAP */

    /* LLWU_FILT1: FILTF=1,FILTE=0,??=0,FILTSEL=0 */
    LLWU->FILT1 = LLWU_FILT1_FILTF_MASK |
                  LLWU_FILT1_FILTE(0x00) |
                  LLWU_FILT1_FILTSEL(0x00);

    /* LLWU_FILT2: FILTF=1,FILTE=0,??=0,FILTSEL=0 */
    LLWU->FILT2 = LLWU_FILT2_FILTF_MASK |
                  LLWU_FILT2_FILTE(0x00) |
                  LLWU_FILT2_FILTSEL(0x00);

    /* SMC_PMPROT: ??=0,??=0,AVLP=1,??=0,ALLS=1,??=0,AVLLS=1,??=0 */
    SMC->PMPROT = SMC_PMPROT_AVLP_MASK |
                  SMC_PMPROT_ALLS_MASK |
                  SMC_PMPROT_AVLLS_MASK;  /* Setup Power mode protection register */
}

/*---------------------------------------------------------------------------
* Name: PWRLib_RamBankRetained
* Description: Provide RAM banks to be retained : 16K, 32K or all banks
*---------------------------------------------------------------------------*/
static uint8_t PWRLib_RamBankRetained(void)
{
    uint8_t  ram_retained;
    uint32_t firmware_upper_limit;

    firmware_upper_limit = PWRLib_GetFwUpperLimit();

    if( firmware_upper_limit < 0x20004000U)
    {
        ram_retained = PRWLIB_RAM_BANK_16K;
    }
    else if( firmware_upper_limit < 0x20008000U)
    {
        ram_retained = PRWLIB_RAM_BANK_32K;
    }
    else
    {
        ram_retained = PRWLIB_RAM_BANK_ALL;
    }

    //PWR_DBG_LOG("heap_upper_limit=%x CSTACK_end=%x", heap_upper_limit, (uint32_t)&__CSTACK_end__);
    //PWR_DBG_LOG("fw_upper_limit=%x %d", firmware_upper_limit, ram_retained);

    return ram_retained;
}

#if defined(gPWR_RamOffDuringAdv_d) && (gPWR_RamOffDuringAdv_d == 1)
static bool PWR_IsRamImageValid(void)
{
    bool img_valid = FALSE;

    /* Check Magic value in image flash header - TODO : improve robustness by adding a checksum */
    if (  pwrlib_img_flash_header_p->img_valid_magic == PWRLIB_IMG_MAGIC )
    {
        img_valid = TRUE;
    }

    return img_valid;
}

static void PWRLib_SetMspWarmStack(void)
{
    /* Set stack pointer to warmboot stack */
    asm volatile(" LDR     R0, =m_warmboot_stack_end ");
    asm volatile(" MSR     MSP, R0                  ");
}

static void PWRLib_PrepareFlashForRamImage(void)
{
    NV_Init();

    BOARD_DBGINITSET(0,0);
    BOARD_DBGINITSET(1,0);

    /* check if RAM image section size in flash is not null */
    assert( PWRLIb_MAX_RAM_SIZE > 0u );

    /* Erase Flash to prepare for RAM image saving later on */
    uint32_t  status = NV_FlashEraseSector(gPWR_RamContextFlashBaseAddr, PWRLIb_MAX_RAM_SIZE );
    assert( status == (uint32_t)kStatus_FLASH_Success );
    NOT_USED(status);

    BOARD_DBGINITSET(0,1);
    BOARD_DBGINITSET(1,1);
}

static void PWRLib_GetStackAddr(void)
{
    /* use R0 to get the current stack pointer and store the content in s_pu8Stack pointed by R1 */
    asm volatile("MRS R0, MSP");
    asm volatile("LDR R1,=s_pu8Stack");
    asm volatile("STR R0,[R1]");
}

static void PWRLib_SaveRamImage(void)
{
    pwrlib_img_header_t* img_header_p;
    pwrlib_img_footer_t* img_foot_p;
    uint32_t             img_location_addr;
    uint32_t             firmware_upper_limit;
    uint32_t             ram_size;

    /* update s_pu8Stack */
    PWRLib_GetStackAddr();

    /* we need to make sure the img_header will not be corrupted by the NV_FlashProgramUnaligned function */
    img_location_addr                   = (uint32_t)s_pu8Stack - PWRLIB_STACK_ADDR_MARGIN;
    firmware_upper_limit                = PWRLib_GetFwUpperLimit();
    ram_size                            = firmware_upper_limit - img_location_addr;
    assert( ram_size < PWRLIb_MAX_RAM_SIZE );

    /* build the RAM image header */
    img_header_p                        = (pwrlib_img_header_t*)img_location_addr - 1;
    img_header_p->img_valid_magic       = PWRLIB_IMG_MAGIC;
    img_header_p->img_size              = ram_size;
    img_header_p->img_location_addr     = img_location_addr;

