N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWRLib.c
    /* build the RAM image footer */
    img_foot_p                          = (pwrlib_img_footer_t*)(firmware_upper_limit);
    img_foot_p->img_end_magic           = PWRLIB_IMG_END_MAGIC;

    uint32_t status = NV_FlashProgramUnaligned( gPWR_RamContextFlashBaseAddr, ram_size + sizeof(pwrlib_img_header_t) + sizeof(pwrlib_img_footer_t) , (uint8_t*)img_header_p);

    assert( status == (uint32_t)kStatus_FLASH_Success );
    NOT_USED( status );
}

/* User callback function for EDMA transfer - not used */
static void EDMA_Callback(edma_handle_t *handle, void *param, bool transferDone, uint32_t tcds)
{
}

static void PWRLib_StartTransferDma(uint32_t ram_size, uint32_t img_start_addr)
{
    edma_transfer_config_t      transferConfig;
    edma_config_t               userConfig;
    edma_handle_t               g_EDMA_Handle;
    status_t                    status;

    /* Configure DMAMUX */
    DMAMUX_Init(DMAMUX0);
#if defined(FSL_FEATURE_DMAMUX_HAS_A_ON) && FSL_FEATURE_DMAMUX_HAS_A_ON
    DMAMUX_EnableAlwaysOn(DMAMUX0, 0, true);
#else
    DMAMUX_SetSource(DMAMUX0, 0, 63);
#endif /* FSL_FEATURE_DMAMUX_HAS_A_ON */
    DMAMUX_EnableChannel(DMAMUX0, 0);
    EDMA_GetDefaultConfig(&userConfig);
    EDMA_Init(DMA0, &userConfig);
    EDMA_CreateHandle(&g_EDMA_Handle, DMA0, 0);
    EDMA_SetCallback(&g_EDMA_Handle, EDMA_Callback, NULL);
    EDMA_PrepareTransfer(&transferConfig, (void*)(uint32_t*)(gPWR_RamContextFlashBaseAddr + sizeof(pwrlib_img_header_t)),
                         4, (void*)(uint32_t*)img_start_addr, 4, 4, ram_size + 4u /* ? */, kEDMA_MemoryToMemory);

    status = EDMA_SubmitTransfer(&g_EDMA_Handle, &transferConfig);
    assert(status == kStatus_Success);
    NOT_USED(status);

    EDMA_StartTransfer(&g_EDMA_Handle);
}


static void PWR_RestoreRamImageDma(void)
{
    uint32_t                            img_ram_size;
    uint32_t                            img_start_addr;
    volatile pwrlib_img_footer_t*       img_footer_p;

    img_ram_size                = pwrlib_img_flash_header_p->img_size + sizeof(pwrlib_img_footer_t);
    img_start_addr              = pwrlib_img_flash_header_p->img_location_addr;
    img_footer_p                = (pwrlib_img_footer_t*)(img_start_addr + img_ram_size - sizeof(pwrlib_img_footer_t));
    img_footer_p->img_end_magic = 0u;

    PWRLib_StartTransferDma(img_ram_size, img_start_addr);

    /* Wait for EDMA transfer finish */
    __WFI();

    /* Make sure the last word have been written */
    while ( img_footer_p->img_end_magic != PWRLIB_IMG_END_MAGIC ) {};

    /* Make sure the magic does not remain on next reboot */
    //img_footer_p->img_end_magic = 0u;

    /* Make sure the DMA does not fire when unmasking the interrupts */
    NVIC_ClearPendingIRQ(DMA0_IRQn);
    NVIC_DisableIRQ(DMA0_IRQn);
}

static void PRWLib_RestoreRamImage(void)
{
    bool        is_ram_ctxt_valid;
    is_ram_ctxt_valid = PWR_IsRamImageValid();

    if ( is_ram_ctxt_valid )
    {
        /* change the stack pointer to warmboot stack
           warning, all local variables and stack content will be obsoleted from this point */
        PWRLib_SetMspWarmStack();

        BOARD_DBGLPIOSET(3,0);

#if 0
        static volatile int once = 1;
        while (once) {};
#endif

        PWR_RestoreRamImageDma();

        BOARD_DBGLPIOSET(3,1);

        warmmain();
        /* do not go there */
    }
}

static void PWRLib_RestoreAlwaysOnDomain(void)
{
    /* reconfigure the LLWU unit */
    PWRLib_LLWU_Init();

    /* Not required */
    //SIM->SOPT1 &= ~SIM_SOPT1_OSC32KSEL_MASK ;
    //BOARD_RTC_Init();
    //CLOCK_SetTpmClock(2);

    /* reconfigure the lptmr timer if needed */
    LPTMR0->CSR |= (LPTMR_CSR_TPS(0x00) | LPTMR_CSR_TIE_MASK );
}
#endif
#endif /* #if (cPWR_UsePowerDownMode == 1) */

//#define LL_DEBUG_LP
#ifdef LL_DEBUG_LP
static void PWRLib_BLL_Debug(void)
{
    static volatile uint16_t dbg_event_status;
    static volatile uint16_t dbg_adv_next_instant;
    static volatile uint16_t dbg_adv_next_instant2;
    static volatile uint16_t dbg_nearest_instant;
    static volatile uint16_t dbg_adv_status;

    dbg_event_status           = BLE_LL_REG(EVENT_STATUS);
    dbg_adv_next_instant       = BLE_LL_REG(0x12);

    BLE_LL_REG(ENGINE_INDEX)   = 0x8;    // select other ADV engine
    dbg_adv_next_instant2      = BLE_LL_REG(0x12);
    BLE_LL_REG(ENGINE_INDEX)   = 0x0;    // select back to initial engine

    dbg_nearest_instant        = BLE_LL_REG(0x520);
    dbg_adv_status             = BLE_LL_REG(0x10);
}
#endif

/*****************************************************************************
 *                             PUBLIC FUNCTIONS                              *
 *---------------------------------------------------------------------------*
 * Add to this section all the functions that have global (project) scope.   *
 * These functions can be accessed outside this module.                      *
 * These functions shall have their declarations (prototypes) within the     *
 * interface header file and shall be preceded by the 'extern' keyword.      *
 *---------------------------------------------------------------------------*
 *****************************************************************************/

#if defined(cPWR_BLE_LL_Enable) && (cPWR_BLE_LL_Enable == 1)
/*---------------------------------------------------------------------------
 * Name: PWRLib_BLL_GetInstantTimer
 *---------------------------------------------------------------------------*/
uint16_t PWRLib_BLL_GetInstantTimer(void)
{
    return BLE_LL_REG(TIM_COUNTER_L);
}
#endif

#if defined(cPWR_UsePowerDownMode) && (cPWR_UsePowerDownMode == 1)
/*---------------------------------------------------------------------------
 * Name: PWRLib_LLWU_ClearWakeUpSources
 *---------------------------------------------------------------------------*/
void PWRLib_LLWU_ClearWakeUpSources(void)
{
    LLWU->F1     &= (uint8_t)0xFFU;
    LLWU->F2     &= (uint8_t)0xFFU;
    LLWU->FILT1  |= LLWU_FILT1_FILTF_MASK;
    LLWU->FILT2  |= LLWU_FILT2_FILTF_MASK;
}

