N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWRLib.c
#if (cPWR_BLE_LL_Enable)
/*---------------------------------------------------------------------------
 * Name: PWRLib_ClearRSIMInt
 *---------------------------------------------------------------------------*/
void PWRLib_ClearRSIMInt(void)
{
    if(RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_BLE_RF_OSC_REQ_INT) != 0U)
    {
        RSIM->CONTROL |= RSIM_CONTROL_BLE_RF_OSC_REQ_INT_MASK;
    }
    if( ((BLE_LL_REG_EVENT_STATUS & BLE_LL_EVENT_STATUS_DSM_INT_MASK) != 0U) && ((RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_RSIM_DSM_EXIT)) != 0U) )
    {
        RSIM->CONTROL &= ~RSIM_CONTROL_RSIM_DSM_EXIT_MASK;
        BLE_LL_REG(EVENT_CLEAR) = BLE_LL_EVENT_CLEAR_DSM_INT_MASK;
    }
}


/*---------------------------------------------------------------------------
 * Name: PWRLib_BLL_EnterDSM
 *---------------------------------------------------------------------------*/
bool_t PWRLib_BLL_EnterDSM(void)
{
    bool_t abort = FALSE;    /*  Don t abort by default */

#ifdef LL_DEBUG_LP
    PWRLib_BLL_Debug(void);
#endif

    PWR_DBG_LOG("%x", BLE_LL_REG(EVENT_STATUS));

    /* Abort the procedure if the LLH gets active again */
    if ( ( BLE_LL_REG_CLOCK_CONFIG & BLE_LL_CLOCK_CONFIG_LLH_IDLE_MASK ) == 0U )
    {
        abort = TRUE;
    }
    else
    {
        BLE_LL_REG(EVENT_CLEAR) = BLE_LL_EVENT_CLEAR_DSM_INT_MASK;

#if (cPWR_EnableDeepSleepMode_8 == 1) || (cPWR_EnableDeepSleepMode_5 == 1) || (cPWR_EnableDeepSleepMode_9 == 1)
    if( (mPWRLib_DeepSleepMode == PWR_LOWPOWER_VLLS2_3_LL_DSM3_MODE)
          || (mPWRLib_DeepSleepMode == PWR_LOWPOWER_VLLS2_3_NO_DSM_MODE)
          || (mPWRLib_DeepSleepMode == PWR_LOWPOWER_VLLS2_3_LL_RESET_ADV_MODE) )
        {
            Controller_SaveLlhState();
            BLE_LL_REG(COMMAND_REGISTER) = ENTER_DSM3;
        }
        else
#endif
        {
            BLE_LL_REG(COMMAND_REGISTER) = ENTER_DSM;
        }
    }

    return abort;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_BLL_SetWakeupInstant
 *---------------------------------------------------------------------------*/
void PWRLib_BLL_SetWakeupInstant(uint16_t wakeupInstant)
{
    BLE_LL_REG(WAKEUP_CONTROL) = wakeupInstant;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_BLL_WaitForDSMExit
 *---------------------------------------------------------------------------*/
PWRLIB_PUBLIC void PWRLib_BLL_WaitForDSMExit(void)
{
    while((BLE_LL_REG_EVENT_STATUS & BLE_LL_EVENT_STATUS_DSM_INT_MASK) == 0U)
    {
        BOARD_DBGLPIOSET(4,0);
        PWRLIB_NOP;
        BOARD_DBGLPIOSET(4,1);
    }
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_BLL_GetIntEn
 *---------------------------------------------------------------------------*/
uint16_t PWRLib_BLL_GetIntEn(void)
{
    return BLE_LL_REG(EVENT_ENABLE);
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_BLL_DisableInterrupts
 *---------------------------------------------------------------------------*/
void PWRLib_BLL_DisableInterrupts(uint16_t bmInterrupts)
{
    BLE_LL_REG(EVENT_ENABLE) &= ~ bmInterrupts;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_BLL_EnableInterrupts
 *---------------------------------------------------------------------------*/
void PWRLib_BLL_EnableInterrupts(uint16_t bmInterrupts)
{
    BLE_LL_REG(EVENT_ENABLE) |= bmInterrupts;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_BLL_ClearInterrupts
 *---------------------------------------------------------------------------*/
void PWRLib_BLL_ClearInterrupts(uint16_t bmInterrupts)
{
    BLE_LL_REG(EVENT_CLEAR) |= bmInterrupts;
}
#endif /* (cPWR_BLE_LL_Enable) */

/*---------------------------------------------------------------------------
 * Name: PWRLib_ClearRSIMDsmInt
 *---------------------------------------------------------------------------*/
bool_t PWRLib_ClearRSIMDsmInt(void)
{
#if cPWR_GENFSK_LL_Enable
    if (RSIM->DSM_CONTROL & RSIM_DSM_CONTROL_GEN_SYSCLK_REQ_INT_MASK)
    {
        RSIM->DSM_CONTROL = RSIM->DSM_CONTROL;

        return TRUE;
    }
#endif /* cPWR_GENFSK_LL_Enable */

    return FALSE;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_SetDeepSleepMode
 *---------------------------------------------------------------------------*/
void PWRLib_SetDeepSleepMode(uint8_t lpMode)
{
    mPWRLib_DeepSleepMode = lpMode;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_GetDeepSleepMode
 *---------------------------------------------------------------------------*/
uint8_t PWRLib_GetDeepSleepMode(void)
{
    return mPWRLib_DeepSleepMode;
}

#if (cPWR_EnableDeepSleepMode_1 || cPWR_EnableDeepSleepMode_2 || cPWR_EnableDeepSleepMode_3)
bool PWRLib_MCU_Enter_lls1_2_3(void)
{
    bool lowpower_skipped = FALSE;

    PWRLib_MCU_Enter_LLSx();

    /* detect lowpower skipped by either abort bit in PMC  or LLWU interrupt not being raised */
    if (( (SMC->PMCTRL & SMC_PMCTRL_STOPA_MASK) >> SMC_PMCTRL_STOPA_SHIFT == 1u ) ||
       (NVIC_GetPendingIRQ(LLWU_IRQn) == 0u))
    {
        lowpower_skipped = TRUE;
    }

    return lowpower_skipped;
}
#endif
/*---------------------------------------------------------------------------
 * Name: PWRLib_MCU_Enter_Mode5_8_9
 * Description: Puts the processor into VLLS2 or VLLS3 (Very Low Leakage Stop 2-3).
 *---------------------------------------------------------------------------*/
#if (cPWR_EnableDeepSleepMode_8 || cPWR_EnableDeepSleepMode_5 || cPWR_EnableDeepSleepMode_9)
bool PWRLib_MCU_Enter_vlls2_3(void)
{
    bool     lowpower_skipped = FALSE;
    uint32_t i;
    uint32_t scb_vtor;
#if defined(USE_RTOS) && (USE_RTOS)
    uint32_t scb_icsr;
    uint32_t scb_aircr;
    uint32_t scb_shp[2];
    uint32_t sysTCtrl;
    uint32_t sysTLoad;
#endif
    uint32_t sim_scgc5;
    uint32_t sim_sopt2;
    uint32_t nvic_iser;
    uint32_t nvic_ip[8];

    /* Store SCB registers */
    scb_vtor  = SCB->VTOR;
#if defined(USE_RTOS) && (USE_RTOS)
    scb_icsr  = SCB->ICSR;
    scb_aircr = SCB->AIRCR;
    scb_shp[0] = SCB->SHP[0];
    scb_shp[1] = SCB->SHP[1];
    sysTCtrl = SysTick->CTRL;
    sysTLoad = SysTick->LOAD;
#endif
    sim_scgc5 = SIM->SCGC5;
    sim_sopt2 = SIM->SOPT2;
    nvic_iser = NVIC->ISER[0U];

