N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWRLib.c
    for(i=0;i<8U;i++)
    {
        nvic_ip[i]=NVIC->IP[i];
    }

    if ( 0 == setjmp(pwr_CPUContext))
    {
        uint8_t mode;

#if defined(gPWR_RamOffDuringAdv_d) && (gPWR_RamOffDuringAdv_d == 1)
        BOARD_DBGLPIOSET(5 ,0 );

        if ( PWR_IsRamImageValid() == FALSE )
        {
            if ( gPWRLib_RamSavedStatus == PWRLIB_RAM_TO_BE_SAVED)
            {
                gPWRLib_RamSavedStatus = PWRLIB_RAM_SAVED;
                PWRLib_SaveRamImage();
            }
            else if (gPWRLib_RamSavedStatus > PWRLIB_RAM_TO_BE_SAVED)
            {
                /* If RAM not yet saved, decrease the count down counter */
                gPWRLib_RamSavedStatus--;
            }
            else
            {
                /* nothing to do otherwise */
            }
        }
        BOARD_DBGLPIOSET(5 ,1 );

        if (( PWRLib_AppState == PWR_APP_STATE_ADV ) && ( gPWRLib_RamSavedStatus == PWRLIB_RAM_SAVED ))
        {
#if defined(gPWR_UsePswitchMode_d) && (gPWR_UsePswitchMode_d == 1)
            /* Switch OFF the DCDC immediatly */
            DCDC_ShutDown();
#else
#if (APP_DCDC_MODE == gDCDC_Bypass_c)
            mode = PWRLIB_VLLS_0;
#else
            mode = PWRLIB_VLLS_1;
#endif
#endif  // defined(gPWR_UsePswitchMode_d) && (gPWR_UsePswitchMode_d == 1)
        }
        else
#endif  // defined(gPWR_RamOffDuringAdv_d) && (gPWR_RamOffDuringAdv_d == 1)
        {
            mode = PWRLIB_VLLS_2;
        }

        PWRLib_MCU_Enter_VLLSx(mode);

        PWR_DBG_LOG("late IRQ wakeup mode=%d", mode);
        lowpower_skipped = TRUE;
    }

    BOARD_DBGLPIOSET(0,0);

    /* Restore SCB registers */
    SCB->VTOR   = scb_vtor;
#if defined(USE_RTOS) && (USE_RTOS)
    SCB->ICSR   = scb_icsr;
    SCB->AIRCR  = scb_aircr;
    SCB->SHP[0] = scb_shp[0];
    SCB->SHP[1] = scb_shp[1];
    SysTick->CTRL = sysTCtrl;
    SysTick->LOAD = sysTLoad;
    SysTick->VAL = 0;
#endif

    /* Restore peripheral clocks */
    SIM->SCGC5 = sim_scgc5;
    /* Restore peripheral clock source option */
    SIM->SOPT2 = sim_sopt2;

    for(i=0;i<8U;i++)
    {
        NVIC->IP[i]=nvic_ip[i];
    }
    NVIC->ICPR[0U] = nvic_iser;
    NVIC->ISER[0U] = nvic_iser;

#if defined(gPWR_RamOffDuringAdv_d) && (gPWR_RamOffDuringAdv_d == 1)
    PWRLib_RestoreAlwaysOnDomain();
#endif

    BOARD_DBGLPIOSET(0,1);

    return lowpower_skipped;
}


/*---------------------------------------------------------------------------
* Name: warmmain
* Description: - Overide the weak warmmain function in Base SDK
*              - Entry point for warm boot (no data/bss initialization)
*---------------------------------------------------------------------------*/
void warmmain(void)
{
    /* Entering warmmain with interrupts disabled */
    __disable_irq();

#if defined(USE_RTOS) && (USE_RTOS)
    /* Switch to the psp stack */
    asm volatile("movs r0, #2");
    asm volatile("msr CONTROL, r0");
#endif

    /* Restore previous context */
    longjmp(pwr_CPUContext, 1);
}
#endif   /* #if cPWR_EnableDeepSleepMode_8 || cPWR_EnableDeepSleepMode_5 || cPWR_EnableDeepSleepMode_9 */


void SystemInitHook (void)
{
    /* restart 32MHz oscillator as soon as possible in case it has not been restarted yet by HW */
    RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, 1);

    if((PMC_REGSC & PMC_REGSC_ACKISO_MASK) != 0x00U)
    {
        PMC->REGSC |= PMC_REGSC_ACKISO_MASK; /* Release hold with ACKISO:  Only has an effect if recovering from VLLSx.*/
    }

    BOARD_DBGINITDBGIO();
    BOARD_DBGTOGGLEDBGIO();
    BOARD_DBGINITSET(0,0);

    /* In case of POR or VLLS0/1 exit */
    /* Increase MCU clock frequency ( 48MHz instead of default 20~25 MHz) */
    BOARD_SetCoreClock48Mhz();

#if defined(gPWR_RamOffDuringAdv_d) && (gPWR_RamOffDuringAdv_d == 1)
    PRWLib_RestoreRamImage();
#endif
    BOARD_DBGINITSET(0,1);
}

void SystemInitHookWarm (void)
{
    /* restart 32MHz oscillator as soon as possible in case it has not been restarted yet by HW */
    RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, 1);

    if((PMC_REGSC & PMC_REGSC_ACKISO_MASK) != 0x00U)
    {
        PMC->REGSC |= PMC_REGSC_ACKISO_MASK; /* Release hold with ACKISO:  Only has an effect if recovering from VLLSx.*/
    }

    BOARD_DBGINITDBGIO();
    BOARD_DBGTOGGLEDBGIO();
    BOARD_DBGINITSET(0,0);
    BOARD_DBGINITSET(0,1);
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_MCUEnter_VLLSx
 * Description: Puts the processor into VLLS0 - VLLS3 (Very Low Leakage Stop 0-3).
 *---------------------------------------------------------------------------*/
void PWRLib_MCU_Enter_VLLSx(uint8_t mode)
{
    uint8_t stopctrl      = 0U;

    BOARD_DBGLPIOSET(2,1);

    PWRLib_BLPEtoBLPI();

    if ( mode == PWRLIB_VLLS_2 )
    {
        uint8_t ram_retained;
		ram_retained = PWRLib_RamBankRetained();

        switch (ram_retained)  {
        case PRWLIB_RAM_BANK_16K:
            stopctrl = SMC_STOPCTRL_PSTOPO(0x00) | SMC_STOPCTRL_LLSM(PWRLIB_VLLS_2);   /* do not set SMC_STOPCTRL_RAM2PO_MASK */
            break;

        case PRWLIB_RAM_BANK_32K:
            stopctrl = SMC_STOPCTRL_PSTOPO(0x00) | SMC_STOPCTRL_LLSM(PWRLIB_VLLS_2) | SMC_STOPCTRL_RAM2PO_MASK;
            break;

        case PRWLIB_RAM_BANK_ALL:
        default:
            /* VLLS2 can not be achieved, -> switch to VLLS3 */
            stopctrl = SMC_STOPCTRL_PSTOPO(0x00) | SMC_STOPCTRL_LLSM(PWRLIB_VLLS_3);
            break;
        }
    }
    else
    {
#if defined(cPWR_POR_DisabledInVLLS0)
        /* VLLS0 with POR disabled */
        stopctrl = SMC_STOPCTRL_PSTOPO(0x00) | SMC_STOPCTRL_LLSM(mode) | SMC_STOPCTRL_PORPO_MASK;
#else
        /* VLLS0 with POR enabled or VLLS1 */
        stopctrl = SMC_STOPCTRL_PSTOPO(0x00) | SMC_STOPCTRL_LLSM(mode);
#endif
    }

    /* Set the SLEEPDEEP bit to enable CORTEX M0 deep sleep mode */
    SCB->SCR      = (SCB->SCR &  ~(uint32_t)SCB_SCR_SLEEPONEXIT_Msk) | SCB_SCR_SLEEPDEEP_Msk;

    SMC->PMCTRL   = (uint8_t)((SMC->PMCTRL & (uint8_t)~(uint8_t)(SMC_PMCTRL_STOPM(0x03))) | (uint8_t)(SMC_PMCTRL_STOPM(0x04)));

