N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWRLib.c
    SMC->STOPCTRL = stopctrl;

    /* Clear any systick interrupts that could happen before the systick disabled */
    SCB->ICSR = SCB_ICSR_PENDSTCLR_Msk;

    BOARD_DBGLPIOSET(2,0);
    BOARD_DBGLPIOSET(2,1);
    BOARD_DBGLPIOSET(2,0);
    BOARD_DBGSETDBGIOFORLOWPOWER();

    /* Execute WFI instruction from RAM */
    PWRLib_ExecuteWfiFromRam();

    BOARD_DBGINITDBGIO();
    BOARD_DBGLPIOSET(2,0);
    BOARD_DBGLPIOSET(2,1);
    BOARD_DBGLPIOSET(2,0);
    BOARD_DBGLPIOSET(2,1);
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_MCUEnter_LLSx
 * Description: Puts the processor into LLSx (Low Leakage Stop1).
 *---------------------------------------------------------------------------*/
void PWRLib_MCU_Enter_LLSx(void)
{
    uint8_t stopctrl      = 0U;
    uint8_t ram_retained;

    BOARD_DBGLPIOSET(2,1);

    PWRLib_BLPEtoBLPI();

    ram_retained = PWRLib_RamBankRetained();

    switch (ram_retained)  {
    case PRWLIB_RAM_BANK_16K:
        stopctrl = SMC_STOPCTRL_PSTOPO(0x00) | SMC_STOPCTRL_LLSM(PWRLIB_LLS_2);   /* do not set SMC_STOPCTRL_RAM2PO_MASK */
        break;

    case PRWLIB_RAM_BANK_32K:
        stopctrl = SMC_STOPCTRL_PSTOPO(0x00) | SMC_STOPCTRL_LLSM(PWRLIB_LLS_2) | SMC_STOPCTRL_RAM2PO_MASK;
        break;

    case PRWLIB_RAM_BANK_ALL:
    default:
        /* LLS2 can not be achieved, -> switch to LLS3 */
        stopctrl = SMC_STOPCTRL_PSTOPO(0x00) | SMC_STOPCTRL_LLSM(PWRLIB_LLS_3);
        break;
    }

    PWRLib_LLWU_ClearWakeUpSources();

    /* Set the SLEEPDEEP bit to enable CORTEX M0 deep sleep mode */
    SCB->SCR      = (SCB->SCR &  ~(uint32_t)SCB_SCR_SLEEPONEXIT_Msk) | SCB_SCR_SLEEPDEEP_Msk;

    SMC->PMCTRL   = (uint8_t)((SMC->PMCTRL & (uint8_t)~(uint8_t)(SMC_PMCTRL_STOPM(0x04))) | (uint8_t)(SMC_PMCTRL_STOPM(0x03)));

    SMC->STOPCTRL = stopctrl;

    BOARD_DBGLPIOSET(2,0);
    BOARD_DBGSETDBGIOFORLOWPOWER();

    /* Execute WFI instruction from RAM */
    PWRLib_ExecuteWfiFromRam();

    BOARD_DBGINITDBGIO();
    BOARD_DBGLPIOSET(2,0);
    BOARD_DBGLPIOSET(2,1);
    BOARD_DBGLPIOSET(2,0);
}


/*---------------------------------------------------------------------------
 * Name: PWRLib_MCUEnter_Stop
 * Description: Puts the processor into Stop
 *---------------------------------------------------------------------------*/
void PWRLib_MCU_Enter_Stop(void)
{
    BOARD_DBGLPIOSET(3,0);

    /* Set the SLEEPDEEP bit to enable CORTEX M0 deep sleep mode */
    SCB->SCR = (SCB->SCR &  ~(uint32_t)SCB_SCR_SLEEPONEXIT_Msk) | SCB_SCR_SLEEPDEEP_Msk;

    SMC->PMCTRL   = (uint8_t)(SMC->PMCTRL & (uint8_t)~(uint8_t)(SMC_PMCTRL_STOPM(0x07)));
#if defined(cPWR_UsePartialStopMode) && (cPWR_UsePartialStopMode == 1)
    /* Reduce Core Clock to its minimum so the consumption can be reduced
       We observed a descrease of about 0.6-0.7mA in power consumption */
    BOARD_ResetCoreClock();
    SMC->STOPCTRL = (SMC_STOPCTRL_PSTOPO(0x02) | SMC_STOPCTRL_LLSM(0x00));
#else
    SMC->STOPCTRL = (SMC_STOPCTRL_PSTOPO(0x00) | SMC_STOPCTRL_LLSM(0x00));
#endif

    /* Execute WFI instruction from RAM */
    PWRLib_ExecuteWfiFromRam();

#if defined(cPWR_UsePartialStopMode) && (cPWR_UsePartialStopMode == 1)
    /* set the core clock back to 48MHz */
    BOARD_SetCoreClock48Mhz();
#endif

    BOARD_DBGLPIOSET(3,1);
}


/*---------------------------------------------------------------------------
 * Name: PWRLib_MCUEnter_Sleep
 *---------------------------------------------------------------------------*/
void PWRLib_MCU_Enter_Sleep(void)
{
    BOARD_DBGLPIOSET(1,0);

    /* SCB_SCR: SLEEPDEEP=0 & SLEEPONEXIT=0 */
    SCB->SCR &= (uint32_t)~(uint32_t)(SCB_SCR_SLEEPDEEP_Msk | SCB_SCR_SLEEPONEXIT_Msk);

    /* Execute WFI instruction from RAM */
    PWRLib_ExecuteWfiFromRam();

    BOARD_DBGLPIOSET(1,1);
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LLWU_GetWakeUpFlags
 *---------------------------------------------------------------------------*/
PWRLIB_PUBLIC uint32_t PWRLib_LLWU_GetWakeUpFlags(void)
{
    uint32_t Flags;

    Flags = LLWU->F1;
    Flags |= (uint32_t)((uint32_t)LLWU->F2 << 8U);
    Flags |= (uint32_t)((uint32_t)LLWU->F3 << 16U);

    if ((LLWU_REG_FILT1 & 0x80U) != 0x00U )
    {
        Flags |= LLWU_FILTER1;
    }

    if ((LLWU_REG_FILT2 & 0x80U) != 0x00U )
    {
        Flags |= LLWU_FILTER2;
    }

    return Flags;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LLWU_UpdateWakeupReason
 *---------------------------------------------------------------------------*/
void PWRLib_LLWU_UpdateWakeupReason(void)
{
    uint32_t  llwuFlags;

    llwuFlags =  PWRLib_LLWU_GetWakeUpFlags();

    /* Update PWRLib_MCU_WakeupReason - this variable will be used later :
      - by the application in case of wakeup up from RAM off
      - On exit from */
    PWRLib_LLWU_UpdateWakeupReasonExt(llwuFlags);

    /* Clear LLWU wakeup source - now use PWRLib_MCU_WakeupReason instead */
    PWRLib_LLWU_ClearWakeUpSources();
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LLWU_DisableAllWakeupSources
 *---------------------------------------------------------------------------*/
void PWRLib_LLWU_DisableAllWakeupSources(void)
{
    LLWU->PE1 = 0U;
    LLWU->PE2 = 0U;
    LLWU->PE3 = 0U;
    LLWU->PE4 = 0U;
    LLWU->ME = 0U;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_GetTimeSettings
 * Parameters: timeInMs can't go over (2^32)/LPTMR_CLK_FREQ to avoid overflow
 *---------------------------------------------------------------------------*/
void PWRLib_LPTMR_GetTimeSettings(uint32_t timeInMs, uint8_t* pClkMode,uint32_t* pTicks, uint32_t* pFreq)
{
    uint64_t ticks64;
    uint32_t ticks;
    uint8_t divide_order = 1U;
    uint8_t prescaler = 0U;
    uint32_t freq = LPTMR_CLK_FREQ;

    if(timeInMs > (uint32_t)mLptmrTimoutMaxMs_c)
    {
        timeInMs = mLptmrTimoutMaxMs_c;
    }
    ticks64  = (uint64_t)timeInMs;
    ticks64 *= (uint64_t)freq;
    ticks64 /= 1000U;
    ticks = (uint32_t)ticks64;

#if defined(PWRLib_LPTMR_FREQ_DIV)
    divide_order +=PWRLib_LPTMR_FREQ_DIV;
    ticks >>= PWRLib_LPTMR_FREQ_DIV;
#else
    while(ticks > (LPTMR_MAX_CNT_VALUE >> 1))
    {
        divide_order++;
        ticks >>= 1U;
    }
#endif
    /* we divide at least 1 time */
    ticks     >>= 1U;
    freq      >>= divide_order;
    prescaler   = divide_order - 1U; /* prescaler to 0 already divides clock by 2 */

    //PWR_DBG_LOG("ord=%d freq=%d", divide_order, freq);

    *pClkMode =  (uint8_t)(prescaler<<LPTMR_PSR_PRESCALE_SHIFT) | (uint8_t)cLPTMR_Source_Ext_ERCLK32K;
    *pTicks   = ticks;
    *pFreq    = freq;
}

