N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWRLib.c
#if defined(PWRLib_LPTMR_KEEP_RUNNING)
/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_ClockStart
 *---------------------------------------------------------------------------*/
void PWRLib_LPTMR_ClockStart(uint8_t ClkMode, uint32_t Ticks)
{
    /* Set compare value */
    if(Ticks > 0U)
    {
        Ticks--;
    }

    mPWRLib_RTIElapsedTicks = LPTMR0->CNR;

    /* set compare register considering the counter value - register will wrap if it exceeds 16bits*/
    LPTMR0->CMR = Ticks + mPWRLib_RTIElapsedTicks;

    /* Configure prescaler, bypass prescaler and clck source */
    LPTMR0->PSR = ClkMode;
    LPTMR0->CSR |= LPTMR_CSR_TFC_MASK;

    //PWR_DBG_LOG("elapsed_ticks=%d CMR=%d", mPWRLib_RTIElapsedTicks, LPTMR0->CMR);
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_ClockCheck
 *---------------------------------------------------------------------------*/
uint32_t PWRLib_LPTMR_ClockCheck(void)
{
    /* LPTMR is still running */
    if((LPTMR0->CSR & LPTMR_CSR_TEN_MASK) != 0U)
    {
        uint32_t cnr;

        LPTMR0->CNR     = 0U;  /* CNR must be written first in order to be read */
        cnr             = LPTMR0->CNR;

        //PWR_DBG_LOG("CNR=%d prev=%d cmp=%d", cnr, mPWRLib_RTIElapsedTicks, LPTMR0->CMR);

        if(cnr < mPWRLib_RTIElapsedTicks)
        {
            cnr += 0x10000U;
            //PWR_DBG_LOG("wrapped: new CNR=%d ", cnr);
        }

        /* clear compare flag if set */
        LPTMR0->CSR |= LPTMR_CSR_TCF_MASK;

        mPWRLib_RTIElapsedTicks = cnr - mPWRLib_RTIElapsedTicks;

        //PWR_DBG_LOG("elapsed=%d", mPWRLib_RTIElapsedTicks);
    }
    else
    {
        /* Start running the lptmr counter */
        mPWRLib_RTIElapsedTicks = 0U;
        LPTMR0->CNR = 0U;
        LPTMR0->CSR |= LPTMR_CSR_TEN_MASK;
    }

    return mPWRLib_RTIElapsedTicks;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_ClockStop
 *---------------------------------------------------------------------------*/
void PWRLib_LPTMR_ClockStop(void)
{
	PWRLIB_NOP;
}

#else
/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_ClockStart
 *---------------------------------------------------------------------------*/
void PWRLib_LPTMR_ClockStart(uint8_t ClkMode, uint32_t Ticks)
{
    OSA_InterruptDisable();

    LPTMR0->CSR &= ~LPTMR_CSR_TEN_MASK;

    /* Set compare value */
    if(Ticks > 0U)
    {
        Ticks--;
    }

    LPTMR0->CMR = Ticks;
    /* Use specified tick count */
    mPWRLib_RTIElapsedTicks = 0;
    /* Configure prescaler, bypass prescaler and clck source */
    LPTMR0->PSR = ClkMode;
    LPTMR0->CSR |= LPTMR_CSR_TFC_MASK;
    /* Start counting */
    LPTMR0->CSR |= LPTMR_CSR_TEN_MASK;

    OSA_InterruptEnable();
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_ClockCheck
 *---------------------------------------------------------------------------*/
uint32_t PWRLib_LPTMR_ClockCheck(void)
{
    /* LPTMR should be stopped before calling this function */
    assert( (LPTMR0->CSR & LPTMR_CSR_TEN_MASK) == 0U);

    return mPWRLib_RTIElapsedTicks;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_ClockStop
 *---------------------------------------------------------------------------*/
void PWRLib_LPTMR_ClockStop(void)
{
    //PWR_DBG_LOG("%x", LPTMR0->CSR & LPTMR_CSR_TEN_MASK);

    /* LPTMR is still running */
    if((LPTMR0->CSR & LPTMR_CSR_TEN_MASK) != 0U)
    {
        LPTMR0->CNR = 0U;  /* CNR must be written first in order to be read */
        mPWRLib_RTIElapsedTicks = LPTMR0->CNR;

#ifndef NDEBUG
        /* timer compare flag is set, counter should not wrapp */
        if((LPTMR0->CSR & LPTMR_CSR_TCF_MASK) != 0U)
        {
            uint32_t compareReg;

            compareReg = LPTMR0->CMR;
            assert(mPWRLib_RTIElapsedTicks >= compareReg);
        }
#endif
    }

    /* Stop LPTMR */
    LPTMR0->CSR &= ~LPTMR_CSR_TEN_MASK;
}

#endif

#if defined(PWR_FUNCTION_NOT_USED)
/*---------------------------------------------------------------------------
 * Name: PWRLib_StopUpdateWakeupReason
 *---------------------------------------------------------------------------*/
void PWRLib_StopUpdateWakeupReason(void)
{
    uint32_t iser;
    uint32_t ispr;

    iser = NVIC->ISER[0];
    ispr = NVIC->ISPR[0];

    if((( iser & ispr) & (1UL << mUartIrq_d)) != 0U )
    {
        PWRLib_MCU_WakeupReason.Bits.FromSerial = 1U;
    }

    if((( iser & ispr) & (1UL << LVD_LVW_DCDC_IRQn)) != 0U)
    {
        PWRLib_MCU_WakeupReason.Bits.FromPSwitch = 1U;
    }

    if(((iser & ispr) & (1UL << Radio_0_IRQn | 1UL << Radio_1_IRQn)) != 0U)
    {
        PWRLib_MCU_WakeupReason.Bits.FromRadio = 1U;
#if cPWR_GENFSK_LL_Enable
        if((GENFSK->IRQ_CTRL & (GENFSK_IRQ_CTRL_WAKE_IRQ_EN_MASK | GENFSK_IRQ_CTRL_GENERIC_FSK_IRQ_EN_MASK |GENFSK_IRQ_CTRL_WAKE_IRQ_MASK)) ==
           (GENFSK_IRQ_CTRL_WAKE_IRQ_EN_MASK | GENFSK_IRQ_CTRL_GENERIC_FSK_IRQ_EN_MASK |GENFSK_IRQ_CTRL_WAKE_IRQ_MASK))
        {
            PWRLib_MCU_WakeupReason.Bits.DeepSleepTimeout = 1U;
        }
#endif /* cPWR_GENFSK_LL_Enable */
    }

    if(((iser & ispr) & (1UL << LPTMR0_IRQn)) != 0U)
    {
        PWRLib_MCU_WakeupReason.Bits.FromLPTMR = 1U;
        PWRLib_MCU_WakeupReason.Bits.DeepSleepTimeout = 1U;
    }

#if gKeyBoardSupported_d
    if(KBD_IsWakeUpSource())
    {
        PWRLib_MCU_WakeupReason.Bits.FromKeyBoard = 1U;
    }
#endif
}
#endif /* PWR_FUNCTION_NOT_USED */

/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_Isr
 *---------------------------------------------------------------------------*/
static void PWRLib_LPTMR_Isr(void)
{
    LPTMR0->CSR |= LPTMR_CSR_TCF_MASK;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_Init
 *---------------------------------------------------------------------------*/
void PWRLib_LPTMR_Init(void)
{
    OSA_InstallIntHandler((uint32_t)LPTMR0_IRQn,PWRLib_LPTMR_Isr);
    SIM->SCGC5 |= SIM_SCGC5_LPTMR_MASK;

