N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWRLib.c
    LPTMR0->CSR = (LPTMR_CSR_TCF_MASK | LPTMR_CSR_TPS(0x00));  /* Clear control register */
    LPTMR0->CMR = LPTMR_CMR_COMPARE(0x02);  /* Set up compare register */
    NVIC->IP[7] &= ~0x000000FFUL;
    NVIC->IP[7] |=  0x80UL;
    NVIC->ISER[0] |= 0x10000000UL;
    LPTMR0->CSR = (LPTMR_CSR_TIE_MASK | LPTMR_CSR_TPS(0x00));  /* Set up control register */

#if defined(PWRLib_LPTMR_KEEP_RUNNING)
    /* Start running the lptmr counter */
    mPWRLib_RTIElapsedTicks = 0U;
    LPTMR0->CNR = 0U;
    LPTMR0->CSR |= LPTMR_CSR_TEN_MASK;
#endif
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_LPTMR_ReInit
 * Description: - ReInitialize the LPTMR after wakeup from lowpower (VLLS2/3)
 *---------------------------------------------------------------------------*/
void PWRLib_LPTMR_ReInit(void)
{
    CLOCK_EnableClock(kCLOCK_Lptmr0);
    NVIC_SetPriority(LPTMR0_IRQn, 0x80UL >> (8 - __NVIC_PRIO_BITS));
    NVIC_EnableIRQ(LPTMR0_IRQn);
}


/*---------------------------------------------------------------------------
 * Name: PWRLib_LLWU_Isr
 *---------------------------------------------------------------------------*/
PWRLIB_STATIC void PWRLib_LLWU_Isr(void)
{
    //PWR_DBG_LOG("");
    //DBG_LOG_DUMP(FALSE);
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_WaitFor32kOscRestart
 *---------------------------------------------------------------------------*/
#if defined(PWR_WaitFor32kOscRestart) && (PWR_WaitFor32kOscRestart == 1)
static void PWRLib_WaitFor32kOscRestart(void)
{
    bool_t       lptmr_was_off = FALSE;
    uint32_t     DeepSleepTimeMs;
    uint8_t      pe1, pe2, pe3, pe4, me;

    if ( (SIM_REG_SCGC5 & SIM_SCGC5_LPTMR_MASK) == 0U )
    {
        /* if LPTMR clock is not set in SCGC5, Assume LPTMR has not been initialized yet */
        lptmr_was_off = TRUE;
        PWRLib_LPTMR_Init();
    }

    OSA_InterruptDisable();

    /* Backup and disable all sources of wakeup, we need to make sure the wakeup is from the LPTMR counter
        being started from the 32Khz Oscillator */
    pe1 = LLWU->PE1;
    pe2 = LLWU->PE2;
    pe3 = LLWU->PE3;
    pe4 = LLWU->PE4;
    me  = LLWU->ME;
    PWRLib_LLWU_DisableAllWakeupSources();

    /* keep initial max deep sleep time and change it temporarily to 10ms */
    DeepSleepTimeMs = mPWR_DeepSleepTimeMs;
    mPWR_DeepSleepTimeMs = 10U;

    PWR_HandleDeepSleepMode();

    mPWR_DeepSleepTimeMs= DeepSleepTimeMs;

    /* Restore the LLWU wakeup sources */
    LLWU->PE1 = pe1;
    LLWU->PE2 = pe2;
    LLWU->PE3 = pe3;
    LLWU->PE4 = pe4;
    LLWU->ME  = me;

    OSA_InterruptEnable();

    /* LPTMR was not initialized before going to lowpower - deinit then now */
    if (lptmr_was_off == TRUE)
    {
        LPTMR_Deinit(LPTMR0);
        SIM->SCGC5 &= ~SIM_SCGC5_LPTMR_MASK;
    }
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_CheckAndWaitFor32kOscRestart
 *---------------------------------------------------------------------------*/
static void PWRLib_CheckAndWaitFor32kOscRestart(void)
{
    uint16_t resetStatus = PWR_GetSystemResetStatus();

     /* We check if we come from POR, Reset or VLLS0/1 */

    if ((resetStatus & ( gPWRLib_ResetStatus_POR | gPWRLib_ResetStatus_WAKEUP | gPWRLib_ResetStatus_PIN | gPWRLib_ResetStatus_SW)) != 0U)
    {
        /* we check if the 32kHz was shut down before going to low power */
        if( BOARD_WasRtcShutDown() == TRUE )
        {
            PWRLib_WaitFor32kOscRestart();
        }
    }
}
#endif   /* #if defined(PWR_WaitFor32kOscRestart) && (PWR_WaitFor32kOscRestart == 1) */

#endif /* #if (cPWR_UsePowerDownMode==1) */


/*---------------------------------------------------------------------------
* Name: PWRLib_LVD_CollectLevel
*---------------------------------------------------------------------------*/
PWRLib_LVD_VoltageLevel_t PWRLib_LVD_CollectLevel(void)
{
#if ((cPWR_LVD_Enable == 1) || (cPWR_LVD_Enable == 2))

    /* Check low detect voltage 1.6V */
    PMC->LVDSC1 = PMC_LVDSC1_LVDV(0);
    PMC->LVDSC2 = PMC_LVDSC2_LVWV(0);
    PMC->LVDSC1 = PMC_LVDSC1_LVDACK_MASK;

    if(PMC->LVDSC1 & PMC_LVDSC1_LVDF_MASK)
    {
        /* Low detect voltage reached */
        PMC->LVDSC1 = PMC_LVDSC1_LVDACK_MASK;

        return(PWR_LEVEL_CRITICAL);
    }

    /* Check low trip voltage 1.8V */
    PMC->LVDSC1 = PMC_LVDSC1_LVDV(0);
    PMC->LVDSC2 = PMC_LVDSC2_LVWV(0);
    PMC->LVDSC2 |= PMC_LVDSC2_LVWACK_MASK;

    if(PMC->LVDSC2 & PMC_LVDSC2_LVWF_MASK)
    {
        /* Low trip voltage reached */
        PMC->LVDSC2 = PMC_LVDSC2_LVWACK_MASK;  /* Clear flag (and set low trip voltage) */
        PMC->LVDSC1 = PMC_LVDSC1_LVDV(0);  /* Set low trip voltage */

        return(PWR_BELOW_LEVEL_1_8V);
    }

    /* Check low trip voltage 1.9V */
    PMC->LVDSC1 = PMC_LVDSC1_LVDV(0);
    PMC->LVDSC2 = PMC_LVDSC2_LVWV(1);
    PMC->LVDSC2 |= PMC_LVDSC2_LVWACK_MASK;

    if(PMC->LVDSC2 & PMC_LVDSC2_LVWF_MASK)
    {
        /* Low trip voltage reached */
        PMC->LVDSC2 = PMC_LVDSC2_LVWACK_MASK;  /* Clear flag (and set low trip voltage) */
        PMC->LVDSC1 = PMC_LVDSC1_LVDV(0);  /* Set low trip voltage */

        return(PWR_BELOW_LEVEL_1_9V);
    }

    /* Check low trip voltage 2.0V */
    PMC->LVDSC1 = PMC_LVDSC1_LVDV(0);
    PMC->LVDSC2 = PMC_LVDSC2_LVWV(2);
    PMC->LVDSC2 |= PMC_LVDSC2_LVWACK_MASK;

    if(PMC->LVDSC2 & PMC_LVDSC2_LVWF_MASK)
    {
        /* Low trip voltage reached */
        PMC->LVDSC2 = PMC_LVDSC2_LVWACK_MASK;  /* Clear flag (and set low trip voltage) */
        PMC->LVDSC1 = PMC_LVDSC1_LVDV(0);  /* Set low trip voltage */

        return(PWR_BELOW_LEVEL_2_0V);
    }

    /* Check low trip voltage 2.1V */
    PMC->LVDSC1 = PMC_LVDSC1_LVDV(0);
    PMC->LVDSC2 = PMC_LVDSC2_LVWV(3);
    PMC->LVDSC2 |= PMC_LVDSC2_LVWACK_MASK;

    if(PMC->LVDSC2 & PMC_LVDSC2_LVWF_MASK)
    {
        /* Low trip voltage reached */
        PMC->LVDSC2 = PMC_LVDSC2_LVWACK_MASK;  /* Clear flag (and set low trip voltage) */
        PMC->LVDSC1 = PMC_LVDSC1_LVDV(0);  /* Set low trip voltage */

        return(PWR_BELOW_LEVEL_2_1V);
    }

    /* Check low detect voltage (high range) 2.56V */
    PMC->LVDSC1 = PMC_LVDSC1_LVDV(1);  /* Set high trip voltage and clear warning flag */
    PMC->LVDSC2 = PMC_LVDSC2_LVWV(0);
    PMC->LVDSC1 |= PMC_LVDSC1_LVDACK_MASK;

    if(PMC->LVDSC1 & PMC_LVDSC1_LVDF_MASK)
    {
        /* Low detect voltage reached */
        PMC->LVDSC1 = PMC_LVDSC1_LVDACK_MASK;  /* Set low trip voltage and clear warning flag */
        PMC->LVDSC1 = PMC_LVDSC1_LVDV(0);  /* Set low trip voltage */

        return(PWR_BELOW_LEVEL_2_56V);
    }

    /* Check high trip voltage 2.7V */
    PMC->LVDSC1 = PMC_LVDSC1_LVDV(1);
    PMC->LVDSC2 = PMC_LVDSC2_LVWV(0);
    PMC->LVDSC2 |= PMC_LVDSC2_LVWACK_MASK;

    if(PMC->LVDSC2 & PMC_LVDSC2_LVWF_MASK)
    {
        /* Low trip voltage reached */
        PMC->LVDSC2 = PMC_LVDSC2_LVWACK_MASK;  /* Clear flag (and set low trip voltage) */
        PMC->LVDSC1 = PMC_LVDSC1_LVDV(0);  /* Set low trip voltage */

        return(PWR_BELOW_LEVEL_2_7V);
    }

    /* Check high trip voltage 2.8V */
    PMC->LVDSC1 = PMC_LVDSC1_LVDV(1);
    PMC->LVDSC2 = PMC_LVDSC2_LVWV(1);
    PMC->LVDSC2 |= PMC_LVDSC2_LVWACK_MASK;

    if(PMC->LVDSC2 & PMC_LVDSC2_LVWF_MASK)
    {
        /* Low trip voltage reached */
        PMC->LVDSC2 = PMC_LVDSC2_LVWACK_MASK;  /* Clear flag (and set low trip voltage) */
        PMC->LVDSC1 = PMC_LVDSC1_LVDV(0);  /* Set low trip voltage */

        return(PWR_BELOW_LEVEL_2_8V);
    }

    /* Check high trip voltage 2.9V */
    PMC->LVDSC1 = PMC_LVDSC1_LVDV(1);
    PMC->LVDSC2 = PMC_LVDSC2_LVWV(2);
    PMC->LVDSC2 |= PMC_LVDSC2_LVWACK_MASK;

    if(PMC->LVDSC2 & PMC_LVDSC2_LVWF_MASK)
    {
        /* Low trip voltage reached */
        PMC->LVDSC2 = PMC_LVDSC2_LVWACK_MASK;  /* Clear flag (and set low trip voltage) */
        PMC->LVDSC1 = PMC_LVDSC1_LVDV(0);  /* Set low trip voltage */

        return(PWR_BELOW_LEVEL_2_9V);
    }

    /* Check high trip voltage 3.0V */
    PMC->LVDSC1 = PMC_LVDSC1_LVDV(1);
    PMC->LVDSC2 = PMC_LVDSC2_LVWV(3);
    PMC->LVDSC2 |= PMC_LVDSC2_LVWACK_MASK;

    if(PMC->LVDSC2 & PMC_LVDSC2_LVWF_MASK)
    {
        /* Low trip voltage reached */
        PMC->LVDSC2 = PMC_LVDSC2_LVWACK_MASK;  /* Clear flag (and set low trip voltage) */
        PMC->LVDSC1 = PMC_LVDSC1_LVDV(0);  /* Set low trip voltage */

        return(PWR_BELOW_LEVEL_3_0V);
    }

