N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWRLib.c
    PMC->LVDSC2 = PMC_LVDSC2_LVWV(0);
    PMC->LVDSC1 = PMC_LVDSC1_LVDV(0);  /* Set low trip voltage */
#endif /* ((cPWR_LVD_Enable == 1) || (cPWR_LVD_Enable == 2)) */

    /*--- Voltage level is okay > 3.0V */
    return(PWR_ABOVE_LEVEL_3_0V);
}


/*---------------------------------------------------------------------------
 * Name: PWRLib_LVD_PollIntervalCallback
 *---------------------------------------------------------------------------*/
#if (cPWR_LVD_Enable == 2)
static void PWRLib_LVD_PollIntervalCallback(void* param)
{
    (void)param;
    PWRLib_LVD_SavedLevel = PWRLib_LVD_CollectLevel();
}
#endif /* (cPWR_LVD_Enable == 2) */

/*---------------------------------------------------------------------------
 * Name: PWRLib_SetWakeupPins
 *---------------------------------------------------------------------------*/
void PWRLib_SetWakeupPins(uint32_t wkup_pin_set)
{
    LLWU->PE1 = (uint8_t)(wkup_pin_set    ) & 0xFFU;
    LLWU->PE2 = (uint8_t)(wkup_pin_set>>8 ) & 0xFFU;
    LLWU->PE3 = (uint8_t)(wkup_pin_set>>16) & 0xFFU;
    LLWU->PE4 = (uint8_t)(wkup_pin_set>>24) & 0xFFU;
}

/*---------------------------------------------------------------------------
 * Name: PWRLib_Init
 *---------------------------------------------------------------------------*/
void PWRLib_Init(void)
{
#if (cPWR_UsePowerDownMode == 1)
    SIM->SOPT1 &= ~SIM_SOPT1_OSC32KSEL_MASK ;

    BOARD_RTC_Init();

#if defined(gPWR_RamOffDuringAdv_d) && (gPWR_RamOffDuringAdv_d == 1)
    /* Prepare the Flash for storing the RAM image */
    if( gPWRLib_RamSavedStatus == PWRLIB_FLASH_TO_ERASE )
    {
        PWRLib_PrepareFlashForRamImage();
    }
#endif

    /* Wakeup from a LLWU wakeup source */
    if((RCM_REG->SRS0 & RCM_SRS0_WAKEUP_MASK) != 0U)
    {
        /* update the wakeup reason, the handling of the wakeup reason shall be done in the application init */
        PWRLib_LLWU_UpdateWakeupReason();

        /* wakeup from external reset pin */
        if((RCM_REG->SRS0 & RCM_SRS0_PIN_MASK) != 0U)
        {
            PWRLib_MCU_WakeupReason.Bits.FromReset = 1U;
        }

        if((RCM_REG->SRS1 & RCM_SRS1_SW_MASK) != 0U)
        {
            PWRLib_MCU_WakeupReason.Bits.FromSwReset = 1U;
        }
    }

    PWRLib_LLWU_Init();

#if (gTMR_EnableLowPowerTimers_d)
    PWRLib_LPTMR_Init();
#endif

    /* Install LLWU ISR and validate it in NVIC */
    OSA_InstallIntHandler((uint32_t)LLWU_IRQn, PWRLib_LLWU_Isr);
    NVIC_SetPriority(LLWU_IRQn, 2);
    NVIC_EnableIRQ(LLWU_IRQn);

#if defined(PWR_WaitFor32kOscRestart) && (PWR_WaitFor32kOscRestart == 1)
    PWRLib_CheckAndWaitFor32kOscRestart();
#endif

#if cPWR_GENFSK_LL_Enable
    /* 32MHz oscillator should be ready to be able to access registers */
    assert((RSIM->CONTROL & RSIM_CONTROL_RF_OSC_READY_MASK) != 0U);
    SIM->SCGC5 |= SIM_SCGC5_GEN_FSK_MASK;
    GENFSK->IRQ_CTRL |= GENFSK_IRQ_CTRL_WAKE_IRQ_EN_MASK | GENFSK_IRQ_CTRL_GENERIC_FSK_IRQ_EN_MASK;
#endif /* cPWR_GENFSK_LL_Enable */

    RSIM->RF_OSC_CTRL  = (RSIM->RF_OSC_CTRL & ~RSIM_RF_OSC_CTRL_RADIO_EXT_OSC_OVRD_MASK) | RSIM_RF_OSC_CTRL_RADIO_EXT_OSC_OVRD_EN_MASK;

#endif /* (cPWR_UsePowerDownMode == 1) */

    /* LVD_Init TBD */
#if (cPWR_LVD_Enable == 0)
    PMC->LVDSC1 &= (uint8_t) ~( PMC_LVDSC1_LVDIE_MASK  | PMC_LVDSC1_LVDRE_MASK);
    PMC->LVDSC2 &= (uint8_t) ~( PMC_LVDSC2_LVWIE_MASK );
#elif ((cPWR_LVD_Enable == 1) || (cPWR_LVD_Enable == 2))
    PMC->LVDSC1 &= (uint8_t) ~( PMC_LVDSC1_LVDIE_MASK | PMC_LVDSC1_LVDRE_MASK);
    PMC->LVDSC2 &= (uint8_t) ~( PMC_LVDSC2_LVWIE_MASK );
#elif (cPWR_LVD_Enable==3)
    PMC->LVDSC1 = (PMC->LVDSC1 | (uint8_t)PMC_LVDSC1_LVDRE_MASK) & (uint8_t)(~PMC_LVDSC1_LVDIE_MASK );
    PMC->LVDSC2 &= (uint8_t) ~( PMC_LVDSC2_LVWIE_MASK );
#endif /* (cPWR_LVD_Enable) */

#if (cPWR_LVD_Enable == 2)
#if ((cPWR_LVD_Ticks == 0) || (cPWR_LVD_Ticks > 71582))
#error  "*** ERROR: cPWR_LVD_Ticks invalid value"
#endif /* ((cPWR_LVD_Ticks == 0) || (cPWR_LVD_Ticks > 71582)) */

    PWRLib_LVD_SavedLevel = PWRLib_LVD_CollectLevel();

    /* Allocate a platform timer */
    PWRLib_LVD_PollIntervalTmrID = TMR_AllocateTimer();

    if(gTmrInvalidTimerID_c != PWRLib_LVD_PollIntervalTmrID)
    {
        /* start the timer */
        TMR_StartLowPowerTimer(PWRLib_LVD_PollIntervalTmrID, gTmrIntervalTimer_c,TmrMinutes(cPWR_LVD_Ticks) , PWRLib_LVD_PollIntervalCallback, NULL);
    }
#endif /* (cPWR_LVD_Enable == 2) */
}

/*FUNCTION**********************************************************************
 * Function Name : PWRLib_InitOsc0
 * Description   : This function is used to setup MCG OSC with Ref oscillator for KW40_512.
 *END**************************************************************************/
#if defined(cPWR_PwrUseBlpeMode) && (cPWR_PwrUseBlpeMode == 1)
static void PWRLib_InitOsc0(void)
{
#define PWRLIB_XTAL0_CLK_HZ                         32000000U  /*!< Board xtal0 frequency in Hz */
    const osc_config_t oscConfig = {
      .freq = PWRLIB_XTAL0_CLK_HZ, .workMode = kOSC_ModeExt,
    };

    /* Initializes OSC0 according to previous configuration to meet Ref OSC needs. */
    CLOCK_InitOsc0(&oscConfig);

    /* Passing the XTAL0 frequency to clock driver. */
    CLOCK_SetXtal0Freq(PWRLIB_XTAL0_CLK_HZ);
}
#endif

void PWRLib_BLPItoBPE(void)
{
#if defined(cPWR_PwrUseBlpeMode) && (cPWR_PwrUseBlpeMode == 1)
   BOARD_DBGINITSET(5,0);
   BOARD_DBGINITSET(0,0);
#define MCG_IRCLK_DISABLE                                 0U  /*!< MCGIRCLK disabled */
#define SIM_OSC32KSEL_OSC32KCLK_CLK                       0U  /*!< OSC32KSEL select: OSC32KCLK clock */
   const mcg_config_t PWRLib_BootClockRUN =
    {
        .mcgMode = kMCG_ModeBLPE,                 /* BLPE - Bypassed Low Power External */
        .irclkEnableMode = MCG_IRCLK_DISABLE,     /* MCGIRCLK disabled */
        .ircs = kMCG_IrcSlow,                     /* Slow internal reference clock selected */
        .fcrdiv = 0x1U,                           /* Fast IRC divider: divided by 2 */
        .frdiv = 0x5U,                            /* FLL reference clock divider: divided by 1024 */
        .drs = kMCG_DrsLow,                       /* Low frequency range */
        .dmx32 = kMCG_Dmx32Default,               /* DCO has a default range of 25% */
        .oscsel = kMCG_OscselOsc,                 /* Selects System Oscillator (OSCCLK) */
    };

    /* Initializes OSC0 according to Ref OSC needs. */
    PWRLib_InitOsc0();

    BOARD_DBGINITSET(0,1);
    /* Configure FLL external reference divider (FRDIV). */
    MCG->C1 = (uint8_t)((MCG->C1 & ~MCG_C1_FRDIV_MASK) | MCG_C1_FRDIV(PWRLib_BootClockRUN.frdiv));

