N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/LowPower/Source/MKW38Z4/PWRLib.c
    /* Set MCG to BLPE mode. */
    //(void)CLOCK_BootToBlpeMode(PWRLib_BootClockRUN.oscsel);
    /* Set to FBE mode. */
    MCG->C1 = (uint8_t)((MCG->C1 & ~(MCG_C1_CLKS_MASK | MCG_C1_IREFS_MASK)) |
                        (MCG_C1_CLKS(kMCG_ClkOutSrcExternal)    /* CLKS = 2 */
                         | MCG_C1_IREFS(kMCG_FllSrcExternal))); /* IREFS = 0 */

    BOARD_DBGINITSET(0,0);
    BOARD_DBGINITSET(5,1);
#else
    /* Here add some code to avoid misra issue */
    __asm("NOP");
#endif
}

void PWRLib_BPEtoBLPE(void)
{
#if defined(cPWR_PwrUseBlpeMode) && (cPWR_PwrUseBlpeMode == 1)
    /* MCG_S_CLKST definition. */
    enum _mcg_clkout_stat
    {
        kMCG_ClkOutStatFll, /* FLL.            */
        kMCG_ClkOutStatInt, /* Internal clock. */
        kMCG_ClkOutStatExt, /* External clock. */
        kMCG_ClkOutStatPll  /* PLL.            */
   };

    BOARD_DBGINITSET(5,0);
    /* make sure BPE is reached */
    while ((MCG->S & (MCG_S_IREFST_MASK | MCG_S_CLKST_MASK)) !=
           (MCG_S_IREFST(kMCG_FllSrcExternal) | MCG_S_CLKST(kMCG_ClkOutStatExt)))
    {
         BOARD_DBGINITSET(4,0);
         BOARD_DBGINITSET(4,1);
    }

    /* In FBE now, start to enter BLPE. */
    MCG->C2 |= MCG_C2_LP_MASK;
    BOARD_DBGINITSET(5,1);
#else
    /* Here add some code to avoid misra issue */
    __asm("NOP");
#endif
}

void PWRLib_BLPEtoBLPI(void)
{
#if defined(cPWR_PwrUseBlpeMode) && (cPWR_PwrUseBlpeMode == 1)
    BOARD_DBGINITSET(5,0);
    const mcg_config_t g_blpi_clock_config =
    {
        .mcgMode = kMCG_ModeBLPI,            /* Work in BLPI mode. */
        .irclkEnableMode = (uint8_t)kMCG_IrclkEnable, /* MCGIRCLK enable. */
        .ircs = kMCG_IrcFast,                /* Select IRC4M. */
        .fcrdiv = 0U,                        /* FCRDIV is 0. */

        .frdiv = 5U,
        .drs = kMCG_DrsLow,         /* Low frequency range */
        .dmx32 = kMCG_Dmx32Default, /* DCO has a default range of 25% */
        .oscsel = kMCG_OscselOsc,   /* Select OSC */
    };
   MCG->C2 &= ~(uint8_t)MCG_C2_LP_MASK; /* Disable lowpower. */
    //CLOCK_SetMcgConfig(&g_blpi_clock_config);

    //CLOCK_SetInternalRefClkConfig(g_blpi_clock_config.irclkEnableMode, g_blpi_clock_config.ircs, g_blpi_clock_config.fcrdiv);
    /* Set internal reference clock selection. */

#define MCG_S_IRCST_VAL (((uint32_t)MCG->S & (uint32_t)MCG_S_IRCST_MASK) >> (uint32_t)MCG_S_IRCST_SHIFT)


    /* Update FCRDIV. */
    MCG->SC = (uint8_t)(MCG->SC & ~(MCG_SC_FCRDIV_MASK | MCG_SC_ATMF_MASK | MCG_SC_LOCS0_MASK)) | MCG_SC_FCRDIV(0);
    MCG->C2 = (uint8_t)((MCG->C2 & ~MCG_C2_IRCS_MASK) | (MCG_C2_IRCS(g_blpi_clock_config.ircs)));

        /* Set CLKS and IREFS. */
    MCG->C1 = (uint8_t)((MCG->C1 & ~(MCG_C1_CLKS_MASK | MCG_C1_IREFS_MASK)) |
                        (MCG_C1_CLKS(kMCG_ClkOutSrcOut )    /* CLKS = 1 kMCG_ClkOutSrcInternal   kMCG_ClkOutSrcOut*/
                         | MCG_C1_IREFS( kMCG_FllSrcInternal ))); /* IREFS = 1  kMCG_FllSrcInternal   kMCG_FllSrcExternal*/

    BOARD_DBGINITSET(5,1);

    /* not usefull */
    //CLOCK_SetFbeMode(g_blpi_clock_config.frdiv, g_blpi_clock_config.dmx32, g_blpi_clock_config.drs, (void (*)(void))0);
#else
    /* Here add some code to avoid misra issue */
    __asm("NOP");
#endif
}


